Tekla.Structures.Dialog.Data.MaterialType
The Tekla.Structures.Dialog.Data.MaterialType enum describes different categories of material supported by Tekla Structures.

Tekla.Structures.Dialog.Data.MaterialType.Steel
The steel material.

Tekla.Structures.Dialog.Data.MaterialType.Concrete
The concrete material.